LEXICON: dict[str, str] = {
    "cmd_start_unauthorized_chat": "Добрый день👋\n\n"
    "Для настройки оповещений в Telegram необходимо заполнить заявку на предоставление доступа "
    "и отправить её с рабочей почты на адрес {0}.\n\n"
    "Ваш номер чата: <b>{1}</b>.\n"
    "Укажите этот номер в своей заявке (в поле <i>Telegram ID</i>).\n\n"
    "Скачать шаблон заявки вы можете <b><a href='{2}'>по ссылке</a></b>.",
    "select_action": "Выберите действие 👇",
    "export_chats": "💾 Выгрузить список всех чатов",
    "add_chat": "➕ Авторизовать новый чат",
    "edit_chat": "⚙️ Редактировать авторизованный чат",
    "delete_chat": "🗑️ Удалить авторизованный чат",
    "next": "➡️ Далее",
    "back": "⬅️ Назад",
    "cancel": "❌ Отмена",
    "close": "❌ Закрыть",
    "go_to_main_menu": "↩️ Вернуться в главное меню",
    "chat_id": "<b>Номер чата</b>",
    "chat_title": "<b>ФИО/название чата</b>",
    "phone": "<b>Номер телефона</b>",
    "email": "<b>Электронная почта</b>",
    "commentary": "<b>Комментарий</b>",
    "access_until": "<b>Срок предоставления доступа</b>",
    "input_chat_id": "\nВведите номер чата (Telegram ID из заявки)",
    "input_chat_title": "\nВведите ФИО/название чата",
    "input_phone": "\nВведите номер телефона в формате 7ХХХХХХХХХХ",
    "input_email": "\nВведите адрес электронной почты",
    "input_commentary": "\nПри необходимости введите комментарий.\n"
    "Если комментарий не нужен - нажмите на кнопку Далее",
    "input_access_until": "\nВведите срок предоставления доступа в формате ДД.ММ.ГГГГ\n"
    "Если нужен бессрочный доступ - нажмите на кнопку Далее",
    "confirm": "\nПодтвердить?",
    "yes": "✅ Да",
    "no": "⛔ Нет",
    "request_chat_id_error": "⚠️ Некорректный номер чата",
    "chat_id_not_found": "⚠️ Указанный номер чата не найден",
    "chat_already_authorized": "⚠️ Данный чат уже авторизован\n"
    "Для изменения информации о чате воспользуйтесь функцией редактирования из главного меню",
    "request_chat_title_error": "⚠️ Длина ФИО/названия чата не должна превышать 128 символов",
    "request_phone_error": "⚠️ Неверный формат номера телефона\n"
    "Номер телефона необходимо вводить в формате 7ХХХХХХХХХХ",
    "request_email_error": "⚠️ Длина адреса электронной почты не должна превышать 64 символов",
    "request_commentary_error": "⚠️ Длина комментария не должна превышать 256 символов",
    "request_access_until_time_error": "⚠️ Некорректно введена дата\n"
    "Дата предоставления доступа должна быть не меньше текущей даты",
    "request_access_until_value_error": "⚠️ Некорректно введена дата\n"
    "Дату необходимо вводить в формате ДД.ММ.ГГГГ",
    "chat_adding_cancelled": "Авторизация чата отменена администратором",
    "chat_adding_success": "✅ Чат авторизован\n\n"
    "Для возврата в главное меню воспользуйтесь соответствующей кнопкой",
    "chat_id_button": "Номер чата",
    "chat_title_button": "ФИО/название чата",
    "phone_button": "Номер телефона",
    "email_button": "Электронная почта",
    "commentary_button": "Комментарий",
    "access_until_button": "Срок предоставления доступа",
    "select_chat_for_editing": "Выберите из списка чат для редактирования",
    "selected_chat": "<b>Выбран чат:</b> {0}\n<b>ФИО/название чата:</b> {1}\n\n",
    "save": "💾 Сохранить",
    "input_new_chat_id": "Введите новый номер чата (Telegram ID из заявки)\n",
    "input_new_chat_title": "Введите ФИО/название чата",
    "input_new_phone": "Введите новый номер телефона в формате 7ХХХХХХХХХХ",
    "input_new_email": "Введите новый адрес электронной почты",
    "input_new_commentary": "Введите новый комментарий",
    "input_new_access_until": "Введите срок предоставления доступа в формате ДД.ММ.ГГГГ",
    "unsaved_changes": "<b>⚠️ Несохраненные изменения:</b>",
    "chat_editing_success": "✅ Чат отредактирован\n\n"
    "Для возврата в главное меню воспользуйтесь соответствующей кнопкой",
    "nothing_to_change": "⚠️ Для данного чата нет несохраненных изменений\n\n"
    "Для возврата в главное меню воспользуйтесь соответствующей кнопкой",
    "set_unlimited_access": "⌛️ Установить безлимитный доступ",
    "unlimited": "бессрочно",
    "delete_commentary": "🗑️ Удалить комментарий",
    "empty_commentary": "<i>пустой комментарий</i>",
    "request_group_chat_id_error": "⚠️ Некорректный номер группового чата\n"
    "Номер чата у групп/каналов должен начинаться со знака - (минус)",
    "block_chat": "⛔ Заблокировать авторизованный чат",
    "same_value_error": "⚠️ Новое введенное значение не должно совпадать с текущим",
    "chat_id_already_exists_error": "❗️ Чат с указанным номером уже существует",
    "data_duplication_error": "❗️ Ошибка дублирования данных (номер чата/номер телефона/адрес эл.почты)",
}

LEXICON_COMMANDS_RU: dict[str, str] = {
    "/start": "Старт",
}
